; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v11 ?v6)
             (pred_7 ?v9 ?v2)
             (pred_6 ?v11 ?v2)
             (pred_12 ?v12 ?v11 )
	     (pred_10 ?v11)
             (pred_2 ?v5)
             (pred_3 ?v9)
             (pred_8 ?v2)
             (pred_11 ?v11)
             (pred_1 ?v9)
             (pred_4 ?v11)
             (pred_5 ))



(:action op_2
:parameters (?v1 ?v8 ?v3 ?v10)
:precondition (and (pred_2 ?v1) (pred_2 ?v8) (pred_3 ?v3) (pred_8 ?v10)
          (pred_9 ?v1 ?v8) (pred_7 ?v3 ?v10)
                   (pred_6 ?v8 ?v10) (pred_10 ?v1) 
                   (pred_11 ?v8) (pred_1 ?v3))
:effect (and  (pred_4 ?v8) (not (pred_11 ?v8))))


(:action op_1
:parameters (?v1 ?v13)
:precondition (and (pred_2 ?v1) (pred_2 ?v13)
               (pred_10 ?v1) (pred_9 ?v1 ?v13) (pred_4 ?v13))
:effect (and (pred_10 ?v13) (not (pred_10 ?v1))))

(:action op_4
:parameters (?v1 ?v3)
:precondition (and (pred_2 ?v1) (pred_3 ?v3) 
                  (pred_10 ?v1) (pred_12 ?v3 ?v1) (pred_5 ))
:effect (and (pred_1 ?v3)
   (not (pred_12 ?v3 ?v1)) (not (pred_5 ))))


(:action op_3
:parameters (?v1 ?v7 ?v4)
:precondition (and (pred_2 ?v1) (pred_3 ?v7) (pred_3 ?v4)
                  (pred_10 ?v1) (pred_1 ?v4) (pred_12 ?v7 ?v1))
:effect (and (pred_1 ?v7) (pred_12 ?v4 ?v1)
        (not (pred_1 ?v4)) (not (pred_12 ?v7 ?v1))))

(:action op_5
:parameters (?v1 ?v3)
:precondition (and (pred_2 ?v1) (pred_3 ?v3) 
                  (pred_10 ?v1) (pred_1 ?v3))
:effect (and (pred_5 ) (pred_12 ?v3 ?v1) (not (pred_1 ?v3)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_13 obj_07 obj_25 obj_06 obj_29 obj_18 obj_04 obj_26 obj_30 obj_17 obj_09 obj_22 obj_15 obj_27 obj_21 obj_11 obj_14 obj_28 obj_03 obj_23 obj_20 obj_24 obj_10 obj_02
    obj_16 obj_05
    obj_08 obj_01 obj_12
    )

    (:init
       (pred_5)

       (pred_2 obj_19)
       (pred_2 obj_13)
       (pred_2 obj_07)
       (pred_2 obj_25)
       (pred_2 obj_06)
       (pred_2 obj_29)
       (pred_2 obj_18)
       (pred_2 obj_04)
       (pred_2 obj_26)
       (pred_2 obj_30)
       (pred_2 obj_17)
       (pred_2 obj_09)
       (pred_2 obj_22)
       (pred_2 obj_15)
       (pred_2 obj_27)
       (pred_2 obj_21)
       (pred_2 obj_11)
       (pred_2 obj_14)
       (pred_2 obj_28)
       (pred_2 obj_03)
       (pred_2 obj_23)
       (pred_2 obj_20)
       (pred_2 obj_24)
       (pred_2 obj_10)
       (pred_2 obj_02)
       (pred_8 obj_16)
       (pred_8 obj_05)
       (pred_3 obj_08)
       (pred_3 obj_01)
       (pred_3 obj_12)

       (pred_9 obj_19 obj_29)
       (pred_9 obj_19 obj_13)
       (pred_9 obj_13 obj_18)
       (pred_9 obj_13 obj_07)
       (pred_9 obj_13 obj_19)
       (pred_9 obj_07 obj_04)
       (pred_9 obj_07 obj_25)
       (pred_9 obj_07 obj_13)
       (pred_9 obj_25 obj_26)
       (pred_9 obj_25 obj_06)
       (pred_9 obj_25 obj_07)
       (pred_9 obj_06 obj_30)
       (pred_9 obj_06 obj_25)
       (pred_9 obj_29 obj_17)
       (pred_9 obj_29 obj_18)
       (pred_9 obj_29 obj_19)
       (pred_9 obj_18 obj_09)
       (pred_9 obj_18 obj_04)
       (pred_9 obj_18 obj_13)
       (pred_9 obj_18 obj_29)
       (pred_9 obj_04 obj_22)
       (pred_9 obj_04 obj_26)
       (pred_9 obj_04 obj_07)
       (pred_9 obj_04 obj_18)
       (pred_9 obj_26 obj_15)
       (pred_9 obj_26 obj_30)
       (pred_9 obj_26 obj_25)
       (pred_9 obj_26 obj_04)
       (pred_9 obj_30 obj_27)
       (pred_9 obj_30 obj_06)
       (pred_9 obj_30 obj_26)
       (pred_9 obj_17 obj_21)
       (pred_9 obj_17 obj_09)
       (pred_9 obj_17 obj_29)
       (pred_9 obj_09 obj_11)
       (pred_9 obj_09 obj_22)
       (pred_9 obj_09 obj_18)
       (pred_9 obj_09 obj_17)
       (pred_9 obj_22 obj_14)
       (pred_9 obj_22 obj_15)
       (pred_9 obj_22 obj_04)
       (pred_9 obj_22 obj_09)
       (pred_9 obj_15 obj_28)
       (pred_9 obj_15 obj_27)
       (pred_9 obj_15 obj_26)
       (pred_9 obj_15 obj_22)
       (pred_9 obj_27 obj_03)
       (pred_9 obj_27 obj_30)
       (pred_9 obj_27 obj_15)
       (pred_9 obj_21 obj_23)
       (pred_9 obj_21 obj_11)
       (pred_9 obj_21 obj_17)
       (pred_9 obj_11 obj_20)
       (pred_9 obj_11 obj_14)
       (pred_9 obj_11 obj_09)
       (pred_9 obj_11 obj_21)
       (pred_9 obj_14 obj_24)
       (pred_9 obj_14 obj_28)
       (pred_9 obj_14 obj_22)
       (pred_9 obj_14 obj_11)
       (pred_9 obj_28 obj_10)
       (pred_9 obj_28 obj_03)
       (pred_9 obj_28 obj_15)
       (pred_9 obj_28 obj_14)
       (pred_9 obj_03 obj_02)
       (pred_9 obj_03 obj_27)
       (pred_9 obj_03 obj_28)
       (pred_9 obj_23 obj_20)
       (pred_9 obj_23 obj_21)
       (pred_9 obj_20 obj_24)
       (pred_9 obj_20 obj_11)
       (pred_9 obj_20 obj_23)
       (pred_9 obj_24 obj_10)
       (pred_9 obj_24 obj_14)
       (pred_9 obj_24 obj_20)
       (pred_9 obj_10 obj_02)
       (pred_9 obj_10 obj_28)
       (pred_9 obj_10 obj_24)
       (pred_9 obj_02 obj_03)
       (pred_9 obj_02 obj_10)
       (pred_11 obj_24)
       (pred_11 obj_27)
       (pred_11 obj_11)
       (pred_6  obj_24 obj_16)
       (pred_6  obj_27 obj_05)
       (pred_6  obj_11 obj_16)
       (pred_4 obj_19)
       (pred_4 obj_13)
       (pred_4 obj_07)
       (pred_4 obj_25)
       (pred_4 obj_06)
       (pred_4 obj_29)
       (pred_4 obj_18)
       (pred_4 obj_04)
       (pred_4 obj_26)
       (pred_4 obj_30)
       (pred_4 obj_17)
       (pred_4 obj_09)
       (pred_4 obj_22)
       (pred_4 obj_15)
       (pred_4 obj_21)
       (pred_4 obj_14)
       (pred_4 obj_28)
       (pred_4 obj_03)
       (pred_4 obj_23)
       (pred_4 obj_20)
       (pred_4 obj_10)
       (pred_4 obj_02)

       (pred_7  obj_08 obj_16)
       (pred_7  obj_01 obj_05)
       (pred_7  obj_12 obj_16)
       (pred_12 obj_08 obj_26)
       (pred_12 obj_01 obj_22)
       (pred_12 obj_12 obj_20)
       (pred_10 obj_13)
    )

    (:goal (and
       (pred_12 obj_08 obj_03)
       (pred_12 obj_12 obj_07)
    ))
(:constraints
  (always (not (pred_10 obj_15)))
)
)

; plan
1. (op_1 obj_13 obj_07)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_07)
   goals met: 0 of 2
2. (op_1 obj_07 obj_04)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_04)
   goals met: 0 of 2
3. (op_1 obj_04 obj_26)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_26)
   goals met: 0 of 2
4. (op_4 obj_26 obj_08)
   deleted: (pred_12 obj_08 obj_26) (pred_5)
   added: (pred_1 obj_08)
   goals met: 0 of 2
5. (op_1 obj_26 obj_04)
   deleted: (pred_10 obj_26)
   added: (pred_10 obj_04)
   goals met: 0 of 2
6. (op_1 obj_04 obj_22)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_22)
   goals met: 0 of 2
7. (op_1 obj_22 obj_14)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_14)
   goals met: 0 of 2
8. (op_2 obj_14 obj_24 obj_08 obj_16)
   deleted: (pred_11 obj_24)
   added: (pred_4 obj_24)
   goals met: 0 of 2
9. (op_1 obj_14 obj_24)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_24)
   goals met: 0 of 2
10. (op_5 obj_24 obj_08)
   deleted: (pred_1 obj_08)
   added: (pred_5) (pred_12 obj_08 obj_24)
   goals met: 0 of 2
11. (op_1 obj_24 obj_20)
   deleted: (pred_10 obj_24)
   added: (pred_10 obj_20)
   goals met: 0 of 2
12. (op_4 obj_20 obj_12)
   deleted: (pred_12 obj_12 obj_20) (pred_5)
   added: (pred_1 obj_12)
   goals met: 0 of 2
13. (op_1 obj_20 obj_24)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_24)
   goals met: 0 of 2
14. (op_1 obj_24 obj_14)
   deleted: (pred_10 obj_24)
   added: (pred_10 obj_14)
   goals met: 0 of 2
15. (op_5 obj_14 obj_12)
   deleted: (pred_1 obj_12)
   added: (pred_5) (pred_12 obj_12 obj_14)
   goals met: 0 of 2
16. (op_1 obj_14 obj_24)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_24)
   goals met: 0 of 2
17. (op_4 obj_24 obj_08)
   deleted: (pred_12 obj_08 obj_24) (pred_5)
   added: (pred_1 obj_08)
   goals met: 0 of 2
18. (op_1 obj_24 obj_14)
   deleted: (pred_10 obj_24)
   added: (pred_10 obj_14)
   goals met: 0 of 2
19. (op_1 obj_14 obj_28)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_28)
   goals met: 0 of 2
20. (op_1 obj_28 obj_03)
   deleted: (pred_10 obj_28)
   added: (pred_10 obj_03)
   goals met: 0 of 2
21. (op_5 obj_03 obj_08)
   deleted: (pred_1 obj_08)
   added: (pred_5) (pred_12 obj_08 obj_03)
   goals met: 1 of 2
22. (op_1 obj_03 obj_28)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_28)
   goals met: 1 of 2
23. (op_1 obj_28 obj_14)
   deleted: (pred_10 obj_28)
   added: (pred_10 obj_14)
   goals met: 1 of 2
24. (op_4 obj_14 obj_12)
   deleted: (pred_12 obj_12 obj_14) (pred_5)
   added: (pred_1 obj_12)
   goals met: 1 of 2
25. (op_1 obj_14 obj_22)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_22)
   goals met: 1 of 2
26. (op_1 obj_22 obj_04)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_04)
   goals met: 1 of 2
27. (op_1 obj_04 obj_07)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_07)
   goals met: 1 of 2
28. (op_5 obj_07 obj_12)
   deleted: (pred_1 obj_12)
   added: (pred_5) (pred_12 obj_12 obj_07)
   goals met: 2 of 2
